// Автоматически генерируемый код. Не редактируйте.
namespace myTiles {
    //% fixedInstance jres blockIdentity=images._tile
    export const transparency16 = image.ofBuffer(hex``);
    //% fixedInstance jres blockIdentity=images._tile
    export const tile1 = image.ofBuffer(hex``);
    //% fixedInstance jres blockIdentity=images._tile
    export const tile2 = image.ofBuffer(hex``);
    //% fixedInstance jres blockIdentity=images._tile
    export const tile6 = image.ofBuffer(hex``);

    helpers._registerFactory("tilemap", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "уровень2":
            case "уровень2":return tiles.createTilemap(hex`1000100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000`, img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`, [myTiles.transparency16], TileScale.Sixteen);
            case "уровень3":
            case "уровень3":return tiles.createTilemap(hex`1000100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000`, img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`, [myTiles.transparency16], TileScale.Sixteen);
            case "уровень":
            case "уровень1":return tiles.createTilemap(hex`1e001e00020202020202020202020202020202020202020202020202020202020202030303030303030303030303030303030303030303030303030303030402020202020202020202020202020202020202020202020202020202020602020202020202020202020202020202020202020202020202020202020602020202020202020202020202020202020202020202020202020202020602020202020703030303030303030303030303030303030303030303030502020202020602020202020202020202020202020202020202020202020202020202020602080c0c0c0c0c0c0c0c0c0c0c0c0c0c0c0c0c0c0c0c0c09020202020206020b0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0a020202020206020b0d0d110d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0a020202020206020b0d0d0d0d0d0d0d010d0d0d110d0d0d0d0d0d0d0d0d0a020202020206020b0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d010d0d0d0a020202020206020b0d0d0d0d0d0d0d0d0d0d0d0d110d0d0d0d0d0d0d0d0a020202020206020b0d0d0d0d0d0d110d0d010d0d0d0d0d110d0d0d0d0d0a020202020206020b0d0d110d0d0d0d0d0d0d0d0d0d0d0d0d110d0d0d0d0a020202020206020b0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d010d0a020202020206020b0d0d0d0d110d110d0d110d0d0d0d0d010d0d0d0d0d0a020202020206020b0d0d0d0d0d0d0d0d110d0d0d0d110d0d0d0d0d0d0d0a020202020206020b0d0d0d0d0d0d0d0d0d0d0d0d110d0d0d0d0d110d0d0a020202020206020b010d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0a020202020206020b0d0d0d0d0d110d0d0d0d0d0d0d0d0d0d110d0d0d0d0a020202020206020b0d0d0d0d0d0d0d11110d0d010d0d110d0d0d0d010d0a020202020206020b0d0d0d110d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0a020202020206020b0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0a020202020206020b0d0d0d0d0d0d0d0d110d0d0d0d110d0d110d0d010d0a020202020206020b0d0d0d0d110d0d0d0d110d0d0d0d0d0d0d0d0d0d0d0a020202020206020b010d0d0d0d0d0d0d0d0d0d010d0d0d0d010d0d0d0d0a020202020206020b0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0d0a02020202020602100f0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f0e02020202020602020202020202020202020202020202020202020202020202`, img`
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
..............................
`, [myTiles.transparency16,sprites.castle.tileGrass2,sprites.dungeon.floorLight2,sprites.vehicle.roadHorizontal,sprites.vehicle.roadTurn2,sprites.vehicle.roadTurn4,sprites.vehicle.roadVertical,sprites.vehicle.roadTurn1,sprites.skillmap.islandTile0,sprites.skillmap.islandTile2,sprites.skillmap.islandTile5,sprites.skillmap.islandTile3,sprites.skillmap.islandTile1,sprites.skillmap.islandTile4,myTiles.tile1,myTiles.tile2,myTiles.tile6,sprites.castle.tileGrass1], TileScale.Sixteen);
        }
        return null;
    })

    helpers._registerFactory("tile", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "transparency16":return transparency16;
            case "myTile":
            case "tile1":return tile1;
            case "myTile0":
            case "tile2":return tile2;
            case "myTile4":
            case "tile6":return tile6;
        }
        return null;
    })

}
// Автоматически генерируемый код. Не редактируйте.
